In [1]:
import pandas as pd

In [2]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [3]:
myvar.head()

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [4]:
myvar.tail()

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
myvar.shape

(3, 2)

In [6]:
myvar.columns

Index(['cars', 'passings'], dtype='object')

In [7]:
myvar.dtypes

cars        object
passings     int64
dtype: object

In [8]:
myvar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cars      3 non-null      object
 1   passings  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [9]:
myvar['cars']

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [10]:
myvar[['cars', 'passings']]

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [11]:
cars = myvar['cars']

cars.head()

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [12]:
passings = myvar['passings']

passings.head()

0    3
1    7
2    2
Name: passings, dtype: int64

In [13]:
myvar.loc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [14]:
myvar.loc[1]

cars        Volvo
passings        7
Name: 1, dtype: object

In [15]:
myvar.loc[0][0]

'BMW'

In [16]:
# here n represent last rows
myvar.tail(n=1)

   cars  passings
2  Ford         2

In [17]:
# here n represent first row
myvar.head(n=1)

  cars  passings
0  BMW         3

In [18]:
myvar.loc[[0, 2]]

   cars  passings
0   BMW         3
2  Ford         2

In [19]:
myvar.iloc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [20]:
myvar.loc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [21]:
# difference between iloc and loc : -1 (last row) in iloc not in loc
myvar.iloc[-1]

cars        Ford
passings       2
Name: 2, dtype: object

In [22]:
myvar.iloc[[0, 2]]

   cars  passings
0   BMW         3
2  Ford         2

In [23]:
myvar.loc[:, ['cars']]

    cars
0    BMW
1  Volvo
2   Ford

In [24]:
subset = myvar.loc[:, ['cars']]
subset.head()

    cars
0    BMW
1  Volvo
2   Ford

In [25]:
subset = myvar.iloc[:, [-1]]
subset.head()

   passings
0         3
1         7
2         2

In [26]:
columns = list(range(2))
subset = myvar.iloc[:, columns]
subset.head()

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [27]:
subset = myvar.loc[1, 'cars']
print(subset)
subset = myvar.loc[1, 'passings']
print(subset)

Volvo
7

In [28]:
subset = myvar.iloc[0, 1]
subset

3

In [29]:
subset = myvar.iloc[0:3, 0]
subset

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [30]:
subset = myvar.loc[[1,2], ['cars','passings']]
subset

    cars  passings
1  Volvo         7
2   Ford         2

In [31]:
df = pd.read_csv('./gapminder/data-raw/08_gap-every-five-years.tsv', sep='\t')

In [32]:
df.head(n=10)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

In [33]:
df.head(n=2)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314
1  Afghanistan      Asia  1957   30.332  9240934  820.853030

In [34]:
print(df.groupby('year')['lifeExp'].mean())

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [35]:
print(df.groupby('year')['lifeExp'].median())

year
1952    45.1355
1957    48.3605
1962    50.8810
1967    53.8250
1972    56.5300
1977    59.6720
1982    62.4415
1987    65.8340
1992    67.7030
1997    69.3940
2002    70.8255
2007    71.9355
Name: lifeExp, dtype: float64

In [36]:
print(df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean())

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275